api/app/controllers/episodes_controller.rb

SELECT `episodes`.* FROM `episodes`
---
  def index
    episodes = Episode.all

INSERT INTO `episodes` (`title`, `plot`, `videos_id`, `number`, `created_at`, `updated_at`) VALUES ('First episode', 'he best tv show', 2, 1, '2020-04-23 07:14:53', '2020-04-23 07:14:53')
---
  def create
    episode = Episode.new(episode_params)
    if episode.save