api/app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores` WHERE `stores`.`created_at` BETWEEN '2020-04-20 00:00:00' AND '2020-04-23 23:59:59' AND `stores`.`user_id` = 1 AND `stores`.`video_id` = 4
INSERT INTO `stores` (`user_id`, `video_id`, `created_at`, `updated_at`) VALUES (1, 4, '2020-04-23 18:56:22', '2020-04-23 18:56:22')
---
  def purchase
    range = 3.day.ago.beginning_of_day..Date.today.end_of_day
    stores = Store.where(created_at: range, user_id: params['user_id'], video_id: params['video_id'])
    if stores.blank?
      store = Store.new(store_params)
      if store.save

SELECT `stores`.* FROM `stores` WHERE `stores`.`created_at` BETWEEN '2020-04-20 00:00:00' AND '2020-04-22 23:59:59'
---
  def store
    range = 3.day.ago.beginning_of_day..Date.today.end_of_day
    store = Store.where(created_at: range)