api/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    users = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def show
    if User.exists?(params[:id])
      user = User.find(params[:id])

INSERT INTO `users` (`email`, `created_at`, `updated_at`) VALUES ('hector12j@gmail.com', '2020-04-23 06:48:27', '2020-04-23 06:48:27')
---
  def create
    user = User.new(user_params)
    if user.save

SELECT `users`.* FROM `users`
UPDATE `users` SET `email` = 'hector12j@hotmail.com', `updated_at` = '2020-04-23 06:22:37' WHERE `users`.`id` = 1
---
  def update
    if User.exists?(params[:id])
      render json: User.update(params[:id], user_params)

SELECT `users`.* FROM `users`
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    if User.exists?(params[:id])
      render json: User.destroy(params[:id])