api/app/controllers/videos_controller.rb

  def index
    videos = Video.all.order(created_at: :asc)
---
SELECT `videos`.* FROM `videos` ORDER BY `videos`.`created_at` ASC

  def show
    if Video.exists?(params[:id])
      video = Video.find(params[:id])
---
SELECT `videos`.* FROM `videos`
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1

  def create
    video = Video.new(video_params)
    if video.save
---
INSERT INTO `videos` (`title`, `plot`, `video_type`, `number`, `created_at`, `updated_at`) VALUES ('Matrix', 'is a good movie', 'movie', 1, '2020-04-23 06:42:25', '2020-04-23 06:42:25')

  def update
    if Video.exists?(params[:id])
      render json: Video.update(params[:id], video_params)
---
UPDATE `videos` SET `plot` = 'the best movie', `updated_at` = '2020-04-23 06:47:20' WHERE `videos`.`id` = 1

  def destroy
    if Video.exists?(params[:id])
      Video.destroy(params[:id])
---
DELETE FROM `videos` WHERE `videos`.`id` = 3

  def movies
    videos = Video.where(video_type: 'movie').order(created_at: :asc)
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`video_type` = 'movie' ORDER BY `videos`.`created_at` ASC

  def seasons
    videos = Video.where(video_type: 'season').order(created_at: :asc).includes(:episodes).order(number: :asc)
---
SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`video_id` IN (4, 5) ORDER BY `episodes`.`number` ASC
SELECT `videos`.* FROM `videos` WHERE `videos`.`video_type` = 'seasons' ORDER BY `videos`.`created_at` ASC, `videos`.`number` ASC