api/app/controllers/videos_controller.rb

  def index
    videos = Video.all
    render json: videos.includes(:episodes)
---
SELECT `videos`.* FROM `videos`
SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`video_id` IN (1, 2)

  def show
    if Video.exists?(params[:id])
      video = Video.includes('episodes').find(params[:id])
---
SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`video_id` = 2